SRGDamia1/SAMD-custom-board/board_data/variant.h
    // static constants for the SPI pins, you should not need to modify these
    static const uint8_t SS = PIN_SPI_SS;
    static const uint8_t MOSI = PIN_SPI_MOSI;
    static const uint8_t MISO = PIN_SPI_MISO;
    static const uint8_t SCK = PIN_SPI_SCK;

// Defines needed for SD/SdFat library
#define SDCARD_SPI SPI
#define SDCARD_MISO_PIN PIN_SPI_MISO
#define SDCARD_MOSI_PIN PIN_SPI_MOSI
#define SDCARD_SCK_PIN PIN_SPI_SCK
#define SDCARD_SS_PIN PIN_SPI_SS

// Other pins
#define PIN_ATN (PIN_SPI_SS) // Default Chip Select for SPI (See https://forum.arduino.cc/t/whats-the-purpose-of-the-new-atn-pin/318278)
    static const uint8_t ATN = PIN_ATN;

/**
 * Wire (I2C) Interfaces
 *
 * I2C – Inter-Integrated Circuit (Host operation)
 *
 * @note I2C interfaces are created in libraries/Wire.cpp of the Adafruit Core based on the defines below
 *
 * @warning The SERCOM pads used for SCL and SDA are **not configurable**.
 * SDA must be on pad 0, SCL must be on pad 1!
 * In 4 wire setup, SDA_OUT must be on pad 2 and SCL_OUT must be on pad 3.
 *
 * `WIRE_IT_HANDLER` is used by the SAMD21
 * `WIRE_IT_HANDLER_0` -> `WIRE_IT_HANDLER_3` are used by the SAMD/E51
 *
 */
#define WIRE_INTERFACES_COUNT 1

#define PIN_WIRE_SDA (17) // PA22 SERCOM3/PAD[0]
// ^ Digital pin for I2C Data (SDA) must be pad 0 on a SAMD51 or SAMD21
#define PIN_WIRE_SCL (16) // PA23 SERCOM3/PAD[1]
// ^ Digital pin for I2C Clock (SCL) must be pad 1 on a SAMD51 or SAMD21
#define PERIPH_WIRE sercom3
// ^ the SERCOM instance used for this I2C interface (e.g. sercom0, sercom1, etc.)

// Wire interrupt handlers
#define WIRE_IT_HANDLER SERCOM3_Handler
#define WIRE_IT_HANDLER_0 SERCOM3_0_Handler
#define WIRE_IT_HANDLER_1 SERCOM3_1_Handler
#define WIRE_IT_HANDLER_2 SERCOM3_2_Handler
#define WIRE_IT_HANDLER_3 SERCOM3_3_Handler

    static const uint8_t SDA = PIN_WIRE_SDA;
    static const uint8_t SCL = PIN_WIRE_SCL;

/**
 * USB
 *
 * @note The USB interface is created in SAMD21_USB.cpp of the Adafruit Core based on the defines below.
 * The SAMD21 file is used by both the SAMD21 and the SAMD51.
 *
 * These defines are required:
 *
 * ```cpp
 * #define PIN_USB_HOST_ENABLE (#) // Pin controlling power (VBUS) on the USB port
 * #define PIN_USB_DM (#)          // USB data minus
 * #define PIN_USB_DP (#)          // USB data plus
 * ```
 */
#define PIN_USB_HOST_ENABLE (79) // This must be defined, even if it is not used on your board, to avoid compilation errors.
#define PIN_USB_DM (77)          // PA24
#define PIN_USB_DP (78)          // PA25

/**
 * I2S Interfaces - not used on the Stonefly
 * The Inter-IC Sound Controller provides a bidirectional, synchronous digital audio link
 * with external audio devices.
 */
#define I2S_INTERFACES_COUNT 0

// #define I2S_DEVICE 0
// #define I2S_CLOCK_GENERATOR 3

// #define PIN_I2S_SDO (32)
// #define PIN_I2S_SDI (31)
// #define PIN_I2S_SCK PIN_SERIAL4_TX
// #define PIN_I2S_FS (33)
// #define PIN_I2S_MCK PIN_SERIAL4_RX

/**
 * On-board QSPI Flash
 */
#define EXTERNAL_FLASH_DEVICES GD25Q64E
#define EXTERNAL_FLASH_USE_QSPI

// QSPI Pins
#define PIN_QSPI_SCK (39) // PB10
#define PIN_QSPI_CS (40)  // PB11
#define PIN_QSPI_IO0 (42) // PA08
#define PIN_QSPI_IO1 (43) // PA09
#define PIN_QSPI_IO2 (41) // PA10
#define PIN_QSPI_IO3 (44) // PA11

#if !defined(VARIANT_QSPI_BAUD_DEFAULT)
// TODO: meaningful value for this
#define VARIANT_QSPI_BAUD_DEFAULT 5000000
#endif

/**
 * PCC (Parallel Capture Controller) Pins
 *
 * There is only one possible pin for each signal for PCC.
 * Here you define which digital pin number you've assigned to the corresponding port/pin on your board
 */
#define PIN_PCC_DEN1 (65) // PA12
#define PIN_PCC_DEN2 (66) // PA13
#define PIN_PCC_CLK (31)  // PA14
#define PIN_PCC_D0 (1)    // PA16
#define PIN_PCC_D1 (0)    // PA17
#define PIN_PCC_D2 (51)   // PA18
#define PIN_PCC_D3 (52)   // PA19
#define PIN_PCC_D4 (10)   // PA20
#define PIN_PCC_D5 (11)   // PA21
#define PIN_PCC_D6 (17)   // PA22
#define PIN_PCC_D7 (16)   // PA23
#define PIN_PCC_D8 (35)   // PB14
#define PIN_PCC_D9 (32)   // PB15
#define PIN_PCC_D10 (60)  // PC12
#define PIN_PCC_D11 (61)  // PC13
#define PIN_PCC_D12 (62)  // PC14
#define PIN_PCC_D13 (63)  // PC15

#ifdef __cplusplus
}
#endif

/*----------------------------------------------------------------------------
 *        Arduino objects - C++ only
 *----------------------------------------------------------------------------*/

#ifdef __cplusplus

/*	=========================
 *	===== SERCOM DEFINITION
 *	=========================
 */

// Extern all SERCOM instances here
// SAMD21 has 6 SERCOMs, SAMD51 has 8 SERCOMs
extern SERCOM sercom0;
extern SERCOM sercom1;
extern SERCOM sercom2;
extern SERCOM sercom3;
extern SERCOM sercom4;
extern SERCOM sercom5;
extern SERCOM sercom6;
extern SERCOM sercom7;

// extern all USART/Serial ports here
extern Uart Serial1;
extern Uart Serial2;
extern Uart Serial3;
extern Uart Serial4;

#endif

// These serial port names are intended to allow libraries and architecture-neutral
// sketches to automatically default to the correct port name for a particular type
// of use.  For example, a GPS module would normally connect to SERIAL_PORT_HARDWARE_OPEN,
// the first hardware serial port whose RX/TX pins are not dedicated to another use.
//
// SERIAL_PORT_MONITOR        Port which normally prints to the Arduino Serial Monitor
//
// SERIAL_PORT_USBVIRTUAL     Port which is USB virtual serial
//
// SERIAL_PORT_LINUXBRIDGE    Port which connects to a Linux system via Bridge library
//
// SERIAL_PORT_HARDWARE       Hardware serial port, physical RX & TX pins.
//
// SERIAL_PORT_HARDWARE_OPEN  Hardware serial ports which are open for use.  Their RX & TX
//                            pins are NOT connected to anything by default.
#define SERIAL_PORT_USBVIRTUAL Serial
#define SERIAL_PORT_MONITOR Serial
// Serial has no physical pins broken out, so it's not listed as HARDWARE port
#define SERIAL_PORT_HARDWARE Serial1
#define SERIAL_PORT_HARDWARE_OPEN Serial1

/*----------------------------------------------------------------------------
 *       Other defines
 *
 * Put other defines that will be convenient for your users or libraries here.
 *----------------------------------------------------------------------------*/

#define SerialBee Serial1
static const uint8_t BEEPWR = 18;
static const uint8_t BEERX = PIN_SERIAL1_RX;
static const uint8_t BEETX = PIN_SERIAL1_TX;
static const uint8_t BEEDTR = 23;
static const uint8_t BEERTS = 20;
static const uint8_t BEECTS = 19;
static const uint8_t BEESTATUS = 28;
static const uint8_t BEERESET = 29;

static const uint8_t GROVEPWR = 22;
static const uint8_t GROVEPWR_OFF = 0;
static const uint8_t GROVEPWR_ON = 1;

static const uint8_t BATVOLTPIN = 75; // A9
#define BATVOLT_R1 47                 // in fact 4.7M
#define BATVOLT_R2 100                // in fact 10M

#endif /* _VARIANT_${board_define_name}_ */

// cSpell:words RXPO DIPO DOPO MSSEN SYNCBUSY PERIPH XCLK LINUXBRIDGE
